{"class_name": "Sequential", "keras_version": "1.2.0", "config": [{"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "nb_col": 8, "b_constraint": null, "nb_filter": 16, "bias": true, "trainable": true, "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_1", "activation": "linear", "batch_input_shape": [null, 64, 64, 3], "subsample": [4, 4], "dim_ordering": "th", "input_dtype": "float32", "init": "glorot_uniform", "nb_row": 8}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_1", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 32, "bias": true, "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_2", "activation": "linear", "trainable": true, "subsample": [2, 2], "dim_ordering": "th", "b_constraint": null, "init": "glorot_uniform", "nb_row": 5}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_2", "trainable": true}}, {"class_name": "Convolution2D", "config": {"W_constraint": null, "activity_regularizer": null, "nb_col": 5, "nb_filter": 64, "bias": true, "W_regularizer": null, "b_regularizer": null, "border_mode": "same", "name": "convolution2d_3", "activation": "linear", "trainable": true, "subsample": [2, 2], "dim_ordering": "th", "b_constraint": null, "init": "glorot_uniform", "nb_row": 5}}, {"class_name": "Flatten", "config": {"name": "flatten_1", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_1", "p": 0.2, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_3", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 512, "bias": true, "input_dim": 256, "b_regularizer": null, "name": "dense_1", "activation": "linear", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true}}, {"class_name": "Dropout", "config": {"name": "dropout_2", "p": 0.5, "trainable": true}}, {"class_name": "ELU", "config": {"alpha": 1.0, "name": "elu_4", "trainable": true}}, {"class_name": "Dense", "config": {"W_constraint": null, "activity_regularizer": null, "output_dim": 1, "bias": true, "input_dim": 512, "b_regularizer": null, "name": "dense_2", "activation": "linear", "W_regularizer": null, "b_constraint": null, "init": "glorot_uniform", "trainable": true}}]}